0010DEFINE DATA LOCAL
00201 EMP VIEW OF EMPLOYEES
00302 JOB-TITLE
0040
0050
0060END-DEFINE
0070*
0080H1. HISTOGRAM EMP FOR JOB-TITLE
0090WRITE EMP *NUMBER
0100END-HISTOGRAM
0110END
