0010DEFINE DATA LOCAL
00201 EMP VIEW OF EMPLOYEES
0030  2 PERSONNEL-ID
0040  2 FIRST-NAME
0050  2 NAME
0060  2 SEX
00701 CAR VIEW OF VEHICLES
0080  2 PERSONNEL-ID
0090  2 MAKE
0100  2 MODEL
0110END-DEFINE
0120FIND CAR WITH MAKE = 'FORD'
0130  FIND EMP WITH PERSONNEL-ID = PERSONNEL-ID
0140    IF SEX = 'F'
0150      WRITE  EMP MAKE '/' MODEL
0160    END-IF
0170  END-FIND
0180END-FIND
0190
0200
0210
0220
0230
0240
0250
0260
0270
0280
0290
0300END
