0010DEFINE DATA LOCAL
00201 EMP VIEW OF EMPLOYEES
0030  2 NAME
0040  2 FIRST-NAME
0050  2 JOB-TITLE
0060  2 FULL-ADDRESS
0070    3 ADDRESS-LINE(1)
0080    3 CITY
0090    3 ZIP
0100    3 POST-CODE
0110    3 COUNTRY
0120END-DEFINE
0130READ EMP WITH JOB-TITLE = 'EMPLOYE DE BUREAU'
0140
0150  WRITE EMP
0160
0170END-READ
0180
0190
0200
0210
0220
0230
0240
0250
0260
0270
0280END
