0010DEFINE DATA LOCAL
00201 EMP VIEW OF EMPLOYEES
0030  2 PERSONNEL-ID
0040  2 SEX
0050  2 MAR-STAT
0060  2 FIRST-NAME
0070  2 NAME
0080
00901 CAR VIEW OF VEHICLES
0100  2 MAKE
0110  2 MODEL
0120  2 COLOR
0130
0140END-DEFINE
0150READ CAR
0160  FIND EMP WITH PERSONNEL-ID = PERSONNEL-ID
0170    IF SEX = 'F'
0180      DISPLAY EMP CAR
0190    END-IF
0200  END-FIND
0210END-READ
0220
0230
0240
0250
0260
0270
0280
0290
0300
0310
0320END
